БухЭксп/InformationRegisters/CW_ВнешниеКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ВнешниеКоманды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппыДоступа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасположениеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПередЭлементом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФормыОбъкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ВнешниеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ВнешниеПечатныеФормы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыПодключаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыПодключаемыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_ПодключаемыеКомандыСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(ФормаОбъекта) Экспорт
	
	ИмяОбъектаМетаданных 	= CW_Обмены_ПИ.ПолучитьИмяМетаданногоПоИмениФормы(ФормаОбъекта.ИмяФормы);	
	СсылкаНаМетаданное  	= CW_Обмены_ПИ.МетаданноеКонфигурации(ИмяОбъектаМетаданных);
	ГруппаПользователя  	= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ИмяФормыОбъкта			= CW_Обмены_ПИ.ПолучитьИмяФормыПоПолномуИмениФормы(ФормаОбъекта.ИмяФормы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеКоманды.Обработка КАК Обработка,
	               |	CW_ВнешниеКоманды.Метаданное КАК Метаданное,
	               |	CW_ВнешниеКоманды.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	               |	CW_ВнешниеКоманды.ИмяФормыОбъкта КАК ИмяФормыОбъкта,
	               |	CW_ВнешниеКоманды.Наименование КАК Наименование,
	               |	CW_ВнешниеКоманды.ИмяКоманды КАК ИмяКоманды,
	               |	CW_ВнешниеКоманды.ИмяКартинки КАК ИмяКартинки,
	               |	CW_ВнешниеКоманды.ГруппыДоступа КАК ГруппыДоступа,
	               |	CW_ВнешниеКоманды.Индекс КАК Индекс,
	               |	CW_ВнешниеКоманды.РасположениеГруппы КАК РасположениеГруппы,
	               |	CW_ВнешниеКоманды.ПередЭлементом КАК ПередЭлементом
	               |ИЗ
	               |	РегистрСведений.CW_ВнешниеКоманды КАК CW_ВнешниеКоманды
	               |ГДЕ
	               |	CW_ВнешниеКоманды.Метаданное = &Метаданное
	               |	И CW_ВнешниеКоманды.ИмяФормыОбъкта = &ИмяФормыОбъкта
	               |	И CW_ВнешниеКоманды.Обработка.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ВнешниеКоманды.Обработка.НеИспользуется = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Индекс
	               |АВТОУПОРЯДОЧИВАНИЕ";

	
	Запрос.УстановитьПараметр("Метаданное"		, СсылкаНаМетаданное); 
	Запрос.УстановитьПараметр("ИмяФормыОбъкта"	, ИмяФормыОбъкта); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Префикс =  1;
		Пока Выборка.Следующий() Цикл
			
			МассивГрупп = Выборка.ГруппыДоступа.Получить();
			
			Если МассивГрупп <> Неопределено тогда
				
				Если МассивГрупп.Найти(ГруппаПользователя) <> Неопределено Тогда
					
					СоздатьКомандуФормы(Формаобъекта, Выборка.ИмяКоманды);
					
					УИДОбъекта = Выборка.Обработка.УникальныйИдентификатор();
					ИмяКоманды = ПолучитьИмяКомандыВнешнего(УИДОбъекта, Префикс);
					
					ПрефиксЭлемента 	= ?(ЗначениеЗаполнено(Выборка.ИмяТабличнойЧасти), Выборка.ИмяТабличнойЧасти,"Форма");
					ИмяЭлементаГруппы 	= ПрефиксЭлемента + "ВнешниеКоманды";
					
					ПараметрыКнопки = новый Структура;
					ПараметрыКнопки.Вставить("Имя"					, ИмяКоманды);
					ПараметрыКнопки.Вставить("ИмяКоманды"			, Выборка.ИмяКоманды);
					ПараметрыКнопки.Вставить("ИмяКартинки"			, Выборка.ИмяКартинки);
					ПараметрыКнопки.Вставить("Заголовок"			, Выборка.Наименование);
					ПараметрыКнопки.Вставить("ИмяТабличнойЧасти"	, Выборка.ИмяТабличнойЧасти);
					ПараметрыКнопки.Вставить("ИмяЭлементаГруппы"	, ИмяЭлементаГруппы);
					ПараметрыКнопки.Вставить("ИмяФормыОбъкта"		, Выборка.ИмяФормыОбъкта);
					ПараметрыКнопки.Вставить("РасположениеГруппы"	, Выборка.РасположениеГруппы);
					ПараметрыКнопки.Вставить("ПередЭлементом"		, Выборка.ПередЭлементом);
					
					ДобавитьКнопкуНаФорму(Формаобъекта, ПараметрыКнопки);
					
					Префикс = Префикс + 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Конецесли;
	
КонецПроцедуры

Функция ПолучитьИмяКомандыВнешнего(УИДОбъекта, Префикс)
	
	стрУИД = СтрЗаменить(УИДОбъекта,"-","_");
	Возврат	"_"+Формат(Префикс,"ЧГ=0")+"_УИД_"+стрУИД;  
	
КонецФункции

Процедура СоздатьКомандуФормы(Формаобъекта, ИмяКоманды)
	
	Если Формаобъекта.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		
		// создадим команду
		НоваяКоманда = Формаобъекта.Команды.Добавить(ИмяКоманды); 			// Имя нашей команды
		НоваяКоманда.Заголовок  = "Выполнить внешнюю команду"; 			// заголовок
		НоваяКоманда.Действие   = "ВнешняяКоманда_ВыполнитьКоманду"; 	// Имя функции/процедуры	
		
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьКнопкуНаФорму(Формаобъекта, ПараметрыКнопки)
	
	РасположениеКоманды = Формаобъекта.Элементы.Найти(ПараметрыКнопки.ИмяЭлементаГруппы);
	
	Если РасположениеКоманды = Неопределено Тогда
		
		РасположениеГруппы 	= Неопределено;
		ПередЭлементом 		= Неопределено;
	
		Если ЗначениеЗаполнено(ПараметрыКнопки.РасположениеГруппы) Тогда
			РасположениеГруппы = Формаобъекта.Элементы[ПараметрыКнопки.РасположениеГруппы];
		КонецЕсли;
		
		Если РасположениеГруппы  = Неопределено Тогда
			Если  ЗначениеЗаполнено(ПараметрыКнопки.ИмяТабличнойЧасти) Тогда
				ТаблицаФормы = Формаобъекта.Элементы[ПараметрыКнопки.ИмяТабличнойЧасти];
				Если ТаблицаФормы.ПоложениеКоманднойПанели <> ПоложениеКоманднойПанелиЭлементаФормы.Нет Тогда
					РасположениеГруппы = Формаобъекта.Элементы[ПараметрыКнопки.ИмяТабличнойЧасти].КоманднаяПанель;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Для формы объекта
		Если ЗначениеЗаполнено(ПараметрыКнопки.ПередЭлементом) Тогда
			ПередЭлементом = Формаобъекта.Элементы[ПараметрыКнопки.ПередЭлементом];
		КонецЕсли;
		
		мДанныеФормы 	= СтрРазделить(Формаобъекта.ИмяФормы,".",Ложь);
		ИмяФормыОбъекта = мДанныеФормы[1];
		Если СтрНайти("CW_ЖурналГрузоперевозок,CW_ЖурналЗаявок,CW_ЖурналЗаказов,CW_ЖурналПланированияДДС", ИмяФормыОбъекта) > 0 Тогда
			Если РасположениеГруппы = Неопределено Тогда 
				РасположениеГруппы  = Формаобъекта.Элементы.Найти("ГруппаКоманднаяПанель");
			КонецЕсли;
			Если ПередЭлементом = Неопределено Тогда
				ПередЭлементом 	= РасположениеГруппы.ПодчиненныеЭлементы.Найти("ЖурналГруппа1");
			КонецЕсли;
		КонецЕсли;

		Если РасположениеГруппы  = Неопределено Тогда
			РасположениеГруппы = Формаобъекта.КоманднаяПанель;
		КонецЕсли;
	
		Если ПередЭлементом = Неопределено Тогда
			ПередЭлементом = РасположениеГруппы.ПодчиненныеЭлементы.Найти("ФормаЗакрыть");	
		КонецЕсли;
		
		Если ПередЭлементом = Неопределено Тогда
			//Форма списка документов
			ПередЭлементом 		= РасположениеГруппы.ПодчиненныеЭлементы.Найти("ФормаОбновить");
		КонецЕсли;
		
		РасположениеКоманды = Формаобъекта.Элементы.Вставить(ПараметрыКнопки.ИмяЭлементаГруппы 	,  	// Первый параметр - имя кнопки
		Тип("ГруппаФормы"),  					// Второй параметр 		- тип элемента управления
		РасположениеГруппы,                     // Третий параметр 		- место расположения на форме
		ПередЭлементом                          // Четвертый параметр 	- Элемент перед которым нужно вставить группу
		);	                     
		
		РасположениеКоманды.Вид = ВидГруппыФормы.Подменю;
		
		Если РасположениеКоманды <> Неопределено Тогда 
			РасположениеКоманды.Картинка	= БиблиотекаКартинок.CW_Расширение;
		КонецЕсли; 
		
		РасположениеКоманды.Заголовок	= "Дополнительно";
		
	КонецЕсли;
	
	//Ссмылки на форме
	НайденныйЭлемент =  Формаобъекта.Элементы.Найти(ПараметрыКнопки.Имя);
	
	Если НайденныйЭлемент <> Неопределено Тогда
		Формаобъекта.Элементы.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	// создадим кнопку
	НовыйЭлемент        = Формаобъекта.Элементы.Добавить(ПараметрыКнопки.Имя 	,  	// Первый параметр - имя кнопки
											Тип("КнопкаФормы")		,  	// Второй параметр - тип элемента управления
											РасположениеКоманды)	;	// Третий параметр - место расположения на форме
	
	НовыйЭлемент.Вид    		= ВидКнопкиФормы.КнопкаКоманднойПанели; // вид кнопки
	НовыйЭлемент.Заголовок  	= ПараметрыКнопки.Заголовок;
	НовыйЭлемент.ИмяКоманды 	= ПараметрыКнопки.ИмяКоманды;
	НовыйЭлемент.Картинка 		= ?(ЗначениеЗаполнено(ПараметрыКнопки.ИмяКартинки), БиблиотекаКартинок[ПараметрыКнопки.ИмяКартинки], БиблиотекаКартинок.ЗеленыйШар);
	
КонецПроцедуры

Функция ПолучитьПараметрыВнешнейКоманды(ПараметрыВнешнейКоманды)  Экспорт
	
	Ответ = Новый Структура("ПодключаемыйОбъект, ИмяМетода, ИмяФормы", Неопределено, "","");
	
	ИмяОбъектаМетаданных 	= CW_Обмены_ПИ.ПолучитьИмяМетаданногоПоИмениФормы(ПараметрыВнешнейКоманды.ИмяФормыОбъекта);	
	СсылкаНаМетаданное  	= CW_Обмены_ПИ.МетаданноеКонфигурации(ИмяОбъектаМетаданных);

	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеКоманды.Обработка КАК ПодключаемыйОбработчик
	               |ИЗ
	               |	РегистрСведений.CW_ВнешниеКоманды КАК CW_ВнешниеКоманды
	               |ГДЕ
	               |	CW_ВнешниеКоманды.ИмяКоманды 	= &ИдентификаторКоманды
	               |	И CW_ВнешниеКоманды.Метаданное 	= &СсылкаНаМетаданное";
	
	Запрос.УстановитьПараметр("ИдентификаторКоманды", ПараметрыВнешнейКоманды.ИдентификаторКоманды);
	Запрос.УстановитьПараметр("СсылкаНаМетаданное"	, СсылкаНаМетаданное);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		//Должна быть только одна команда с таким идентифкатором
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			Ответ.ПодключаемыйОбъект 	=  Выборка.ПодключаемыйОбработчик;
			
			Если   Выборка.ПодключаемыйОбработчик.МетодыОбъекта.Количество() > 0 Тогда
				//всегда один метод!!!
				Ответ.ИмяМетода =  Выборка.ПодключаемыйОбработчик.МетодыОбъекта[0].Метод;
			КонецЕсли;
			
			Если _ПО.ПодключитьОбработку( Выборка.ПодключаемыйОбработчик) Тогда	
				Ответ.ИмяФормы = _ПО.ПолучитьПолноеИмяФормыПоТипу( Выборка.ПодключаемыйОбработчик,"Форма");
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Ответ;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ПолучитьПолноеимяФормыОбъекта(ОбъектМетаданных, ИмяФормы)
	
КонецФункции

Функция НоваяСтруктураНастроекПечати() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПодключаемыйОбъект", 	Неопределено);
	Параметры.Вставить("ШаблонПредставления", 	"");
	Параметры.Вставить("ДляРассылки", 			Ложь);
	Параметры.Вставить("ПодписьИПечать",		Ложь);
	Параметры.Вставить("Настройки", 			Неопределено); 
	
	Возврат Параметры;

КонецФункции

//Обработчики После Записи
Функция ПолучитьОбработчикиПослеЗаписи(ТипОбъекта) Экспорт 
	
	Результат				= Новый Массив;
	ИдентификаторОбъекта	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъектыНазначениеОбъекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты.НазначениеОбъекта КАК CW_ПодключаемыеОбъектыНазначениеОбъекта
	               |ГДЕ
	               |	CW_ПодключаемыеОбъектыНазначениеОбъекта.Назначение = &ИдентификаторОбъекта
	               |	И CW_ПодключаемыеОбъектыНазначениеОбъекта.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъектыНазначениеОбъекта.Ссылка.НеИспользуется = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъектыНазначениеОбъекта.Ссылка.Вид = ""ОбработчикПослеЗаписи""
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ПодключаемыеОбъектыНазначениеОбъекта.Ссылка.Индекс";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыВнешнегоОбработчика(ВнешнийОбъект) Экспорт
	
	Ответ = Новый Структура;
	
	Если ВнешнийОбъект.МетодыОбъекта.Количество() > 0 Тогда
		//всегда один метод!!!
		ИмяМетода =  ВнешнийОбъект.МетодыОбъекта[0].Метод;
		Ответ.Вставить("Метод", ИмяМетода);
	КонецЕсли;
	
	ИмяФормы =  "";
	Если _ПО.ПодключитьОбработку(ВнешнийОбъект) Тогда	
		ИмяФормы = _ПО.ПолучитьПолноеИмяФормыПоТипу(ВнешнийОбъект, "Форма");
	КонецЕсли;
	Ответ.Вставить("ИмяФормы", ИмяФормы);
		
	Возврат Ответ;

КонецФункции
//Обработчики перед записью

// Опиание подключаемых обработок
Функция СведенияОПодключаемомОбъекте(ВерсияПодсистемы = "") Экспорт
	
	СтруктураОписания = Новый Структура;
	
	СтруктураОписания.Вставить("Тип",						"");
	СтруктураОписания.Вставить("Вид",						"");
	СтруктураОписания.Вставить("Наименование",				"");
	СтруктураОписания.Вставить("Описание",					"");
	СтруктураОписания.Вставить("Поставщик",					"CoralWay");
	СтруктураОписания.Вставить("Версия",					"0.0.0.0");
	СтруктураОписания.Вставить("ВерсияПодсистемы",			?(ВерсияПодсистемы = "", "0.0.0.0", ВерсияПодсистемы));
	СтруктураОписания.Вставить("МинимальнаяВерсияМодуля",	"");
	
	СтруктураОписания.Вставить("Индекс",					0);
	
	СтруктураОписания.Вставить("ВыполнятьВФоне",			Ложь);
	
	СтруктураОписания.Вставить("РасполагатьНаРабочемСтоле",	Ложь);
	СтруктураОписания.Вставить("Настройка", 				Ложь);
	СтруктураОписания.Вставить("НастройкаСубъекта", 		Ложь);
	СтруктураОписания.Вставить("ИсторияИзменений", 			Ложь);
	
	СтруктураОписания.Вставить("НазначениеОбъекта", 		Новый Массив);
 	СтруктураОписания.Вставить("МетодыОбъекта", 			Новый Массив);
	СтруктураОписания.Вставить("Формы", 					Новый Массив);
	СтруктураОписания.Вставить("КомандыОбъекта", 			Новый Массив);
	СтруктураОписания.Вставить("ПараметрыВнешнейКоманды", 	Новый Массив);   
	СтруктураОписания.Вставить("ИмяВидаПодписки", 			"");   
	
	ТаблицаМакросов = ПолучитьНовуюТаблицуМакросов();
	СтруктураОписания.Вставить("ТаблицаМакросов", 			ТаблицаМакросов);
	
	Возврат СтруктураОписания;

КонецФункции

Функция ПолучитьНовуюТаблицуМакросов()
	
	ТаблицаМакросов = Новый ТаблицаЗначений;
	ТаблицаМакросов.Колонки.Добавить("ИмяМакроса", 				Новый ОписаниеТипов("Строка"));
	ТаблицаМакросов.Колонки.Добавить("ПредставлениеМакроса", 	Новый ОписаниеТипов("Строка"));
	ТаблицаМакросов.Колонки.Добавить("МетодМакроса", 			Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаМакросов;
	
КонецФункции

//Виды подключаемых объектов
Функция ВидОбработкиПечатнаяФорма() Экспорт
	Возврат "ПечатнаяФорма";
КонецФункции

Функция ВидОбработкиВнешнийОтчет() Экспорт
	Возврат "ВнешнийОтчет";
КонецФункции

Функция ВидОбработкиВнешняяОбработка() Экспорт
	Возврат "ВнешняяОбработка";
КонецФункции

Функция ВидОбработкиВнешняяОбработкаОтбораПараметра() Экспорт
	Возврат "ВнешняяОбработкаОтбораПараметра";
КонецФункции

Функция ВидОбработкиВнешняяКоманда() Экспорт
	Возврат "ВнешняяКоманда";
КонецФункции

Функция ВидОбработкиВнешнийНумератор() Экспорт
	Возврат "ВнешнийНумератор";
КонецФункции

Функция ВидОбработкиДополнительнаяФорма() Экспорт
	Возврат "ДополнительнаяФорма";
КонецФункции

Функция ВидОбработкиВнешняяФорма() Экспорт
	Возврат "ВнешняяФорма";
КонецФункции

Функция ВидОбработкиВнешнийМакрос() Экспорт
	Возврат "ВнешнийМакрос";
КонецФункции

Функция ВидОбработкиОбработчикПослеЗаписи() Экспорт
	Возврат "ОбработчикПослеЗаписи";
КонецФункции

Функция ВидОбработкиОбработкаОтправляемыхПисем() Экспорт
	Возврат "ОбработкаОтправляемыхПисем";
КонецФункции

Функция ВидОбработкиОбработчикПрочее() Экспорт
	Возврат "Прочее";
КонецФункции

Функция ВидОбработкиВнешняяПодписка() Экспорт
	Возврат "ВнешняяПодписка";
КонецФункции

Функция ВидОбработкиФормаПараметра() Экспорт
	Возврат "ВнешняяФормаПараметра";
КонецФункции

Функция ВидОбработкиЗаполнениеБюджета() Экспорт
	Возврат "ЗаполнениеБюджета";
КонецФункции

Функция ВидОбработкиЗаполнениеБюджетаГрузоперевозки() Экспорт
	Возврат "ЗаполнениеБюджета_CW_Грузоперевозки";
КонецФункции

Функция ВидОбработкиЗаполнениеБюджетаЗаказа() Экспорт
	Возврат "ЗаполнениеБюджета_CW_Заказы";
КонецФункции

Функция ВидОбработкиОбработкаИзмененияПараметров() Экспорт
	Возврат "ОбработкаИзмененияПараметров";
КонецФункции

Функция ВидОбработкиВнешняяФормаПараметра() Экспорт
	Возврат "ВнешняяФормаПараметра";
КонецФункции

Функция ВидОбработкиВидПечатнаяФорма() Экспорт
	Возврат "ПечатнаяФорма";
КонецФункции

Функция ВидОбработкиОбмен() Экспорт
	Возврат "Обмен";
КонецФункции
//Виды подключаемых объектов

//Виды подписок
Функция	ИмяВидаПодпискиОбработчикПриЗаписи() Экспорт
	Возврат "ОбработчикПриЗаписи";
КонецФункции

Функция	ИмяВидаПодпискиОбработчикПередЗаписью() Экспорт
	Возврат "ОбработчикПередЗаписью";
КонецФункции

Функция ИмяВидаПодпискиОбработчикПриПроведении() Экспорт
	Возврат "ОбработчикПриПроведении";
КонецФункции

Функция ИмяВидаПодпискиОбработчикПередУдалением() Экспорт
	Возврат "ОбработчикПередУдалением";
КонецФункции
//Виды подписок

//Типы подключаемых объектов
Функция ТипОбработка() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка");
КонецФункции

Функция ТипОтчет() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет");
КонецФункции
//ТипыПодключаемых объектов

Функция ПолучитьПредсталениеВида(Вид) Экспорт
	
	Результат = ПолучитьСоответствиеПредставленияВида();
	
	Возврат Результат.Получить(Вид);
	
КонецФункции

Функция ПолучитьСоответствиеПредставленияВида() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("ПечатнаяФорма",					"Печатные формы");  
	Результат.Вставить("ВнешнийОтчет",					"Отчеты");
	Результат.Вставить("ВнешняяОбработка",				"Обработки");
	Результат.Вставить("ВнешняяКоманда",				"Команды");
	Результат.Вставить("ВнешнийНумератор",				"Нумераторы");
	Результат.Вставить("ДополнительнаяФорма",			"Дополнительные формы");
	Результат.Вставить("ВнешняяФорма",					"Внешняя формы");
	Результат.Вставить("ВнешняяПодписка",				"Внешняя Подписка");
	Результат.Вставить("ВнешнийМакрос",					"Внешний макрос");
	Результат.Вставить("ОбработчикПослеЗаписи",			"После записи (На клиенте)");
	Результат.Вставить("ОбработкаИзмененияПараметров",	"Обработка изменения  параметров");
	Результат.Вставить("Обмен",							"Обмен");
	Результат.Вставить("ВнешняяФормаПараметра",			"Внешняя форма параметра");
	Результат.Вставить("ЗаполнениеБюджета",						"Заполнение бюджета");
	Результат.Вставить("ЗаполнениеБюджета_CW_Заказы",			"Заполнение бюджета (Заказы)");
	Результат.Вставить("ЗаполнениеБюджета_CW_Грузоперевозки",	"ЗаполнениеБюджета (Грузоперевозки)");
	Результат.Вставить("ОбработкаОтправляемыхПисем",		"Обработка отправляемых писем");
	Результат.Вставить("ВнешняяОбработкаОтбораПараметра",	"Внешняя обработка отбора параметра");
	Результат.Вставить("Прочее",							"Прочее");
	
	Возврат Результат;

КонецФункции

// Процедура - Установить методы внешней команды
// Параметры:
//  СтруктураОписания	 - 	 структура, в которую будет добавлено опиание параметров внешней команды
//  ИмяМетода			 - 	 имя добавляемого метода, доступные имена: ОткрытьФорму  ВыполнитьВнешнююКомандуНаКлиенте 
//
Процедура УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, ИмяМетода) Экспорт
	
	мМетоды = Новый Массив;
	
	Если СтруктураОписания.Свойство("Методы") Тогда
		мМетоды = СтруктураОписания.Методы;
	КонецЕсли;
	
	Если мМетоды.Найти(ИмяМетода) = Неопределено Тогда
		мМетоды.Добавить(ИмяМетода);
	КонецЕсли;
	
	СтруктураОписания.Вставить("Методы", мМетоды);
	
КонецПроцедуры

//Процедура - Установить описание форм команды
//
//	СОздает описание форм обраблотки 
//
// Параметры:
//  СтруктураОписания	 - 	 структура, в которую будет добавлено опиание параметров внешней команды
//  ТипФормы			 - 	 тип формы: ФормаОбъекта, ФормаНастроек 
//  Имяформы			 - 	 Имя формы обработки, как оно задано в конфигураторе
//
Процедура УстановитьФормыВнешнегоОбъекта(СтруктураОписания, ТипФормы, Имяформы) Экспорт
	
	МассивФорм = Новый Массив;
	Если СтруктураОписания.Свойство("Формы") Тогда
		МассивФорм = СтруктураОписания.Формы;
	КонецЕсли;

	//Формируем структуру форм комнады
	СтруктураФормКоманды = новый Структура;
	СтруктураФормКоманды.Вставить("Тип"			, 	ТипФормы);
	СтруктураФормКоманды.Вставить("Имя"			, 	Имяформы);
	
	МассивФорм.Добавить(СтруктураФормКоманды);
	
	СтруктураОписания.Вставить("Формы"			,	МассивФорм);

КонецПроцедуры

Процедура УстановитьИмяФормыОбъекта(СтруктураОписания, ИмяФормы) Экспорт
	
	МассивФорм = Новый Массив;
	Если СтруктураОписания.Свойство("Формы") Тогда
		МассивФорм = СтруктураОписания.Формы;
	КонецЕсли;

	//Формируем структуру форм комнады
	СтруктураФормКоманды = новый Структура;
	СтруктураФормКоманды.Вставить("Тип", "ФормаОбъекта");
	СтруктураФормКоманды.Вставить("Имя", Имяформы);
	
	МассивФорм.Добавить(СтруктураФормКоманды);
	
	СтруктураОписания.Вставить("Формы",		МассивФорм);

КонецПроцедуры

Процедура УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, Имяформы) Экспорт
	
	МассивФорм = Новый Массив;
	Если СтруктураОписания.Свойство("Формы") Тогда
		МассивФорм = СтруктураОписания.Формы;
	КонецЕсли;

	//Формируем структуру форм комнады
	СтруктураФормКоманды = новый Структура;
	СтруктураФормКоманды.Вставить("Тип", "ФормаНастроек");
	СтруктураФормКоманды.Вставить("Имя", Имяформы);
	
	МассивФорм.Добавить(СтруктураФормКоманды);
	
	СтруктураОписания.Вставить("Формы",		МассивФорм);

КонецПроцедуры

Процедура УстановитьОписаниеВнешнегоМакроса(СтруктураОписания, ИмяМакроса, ПредставлениеМакроса, МетодМакроса) Экспорт
	
	Если СтруктураОписания.Свойство("ТаблицаМакросов") Тогда
		ТаблицаМакросов = СтруктураОписания.ТаблицаМакросов;  
	Иначе
		ТаблицаМакросов = ПустаяТаблицаМакросов();
	КонецЕсли;    
	
	СтрокаМакроса = ТаблицаМакросов.Добавить();
	СтрокаМакроса.ИмяМакроса 			= ИмяМакроса;
	СтрокаМакроса.ПредставлениеМакроса 	= ПредставлениеМакроса;
	СтрокаМакроса.МетодМакроса 			= МетодМакроса;
	
КонецПроцедуры

Функция ПустаяТаблицаМакросов()
	
	ТаблицаМакросов = Новый ТаблицаЗначений;
	ТаблицаМакросов.Колонки.Добавить("ИмяМакроса", 				Новый ОписаниеТипов("Строка"));
	ТаблицаМакросов.Колонки.Добавить("ПредставлениеМакроса", 	Новый ОписаниеТипов("Строка"));
	ТаблицаМакросов.Колонки.Добавить("МетодМакроса", 			Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаМакросов;
	
КонецФункции

Процедура УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, ИмяМакроса, ПредставлениеМакроса, МетодМакроса) Экспорт
	
	Если СтруктураОписания.Свойство("ТаблицаМакросов") Тогда
		ТаблицаМакросов = СтруктураОписания.ТаблицаМакросов;
	Иначе
		ТаблицаМакросов = ПолучитьНовуюТаблицуМакросов();
	КонецЕсли;

	НоваяСтрока = ТаблицаМакросов.Добавить();
	НоваяСтрока.ИмяМакроса 				= ИмяМакроса;
	НоваяСтрока.ПредставлениеМакроса 	= ПредставлениеМакроса;
	НоваяСтрока.МетодМакроса 			= МетодМакроса;
	
	СтруктураОписания.Вставить("ТаблицаМакросов", ТаблицаМакросов);

КонецПроцедуры


// Процедура - Установить параметры внешей команды
//
// СОздает описание команды 
//
// Параметры:
//  СтруктураОписания	 - 	 структура, в которую будет добавлено опиание параметров внешней команды
//  ИмяМетаданных		 - 	 имя объекта метаданных, для которго добавляется команда 
//  ИмяФормыОбъкта		 - 	 имя формы объекта
//  ИмяТабличнойЧасти	 - 	 имя табличной части 
//  Расположение		 - 	 группа на форме 
//  ПередЭлементом		 - 	 элементы формы, перед которым должна быть помещена команда 
//  ПредставлениеКоманды - 	 представление команды 
//
Процедура УстановитьПараметрыВнешнейКоманды(СтруктураОписания, ИмяМетаданного, ИмяФормыОбъкта, ИмяТабличнойЧасти="", Расположение="", ПередЭлементом="",ПредставлениеКоманды) Экспорт
	
	МассивПараметровВнешнейКоманды = Новый Массив;
	Если СтруктураОписания.Свойство("ПараметрыВнешнейКоманды") Тогда
		МассивПараметровВнешнейКоманды = СтруктураОписания.ПараметрыВнешнейКоманды;
	КонецЕсли;
	
	СтруктураВнешнейКоманды = Новый Структура;
	СтруктураВнешнейКоманды.Вставить("ПредставлениеКоманды"		, 	ПредставлениеКоманды);
	СтруктураВнешнейКоманды.Вставить("МетаданныеКонфигурации"	, 	ИмяМетаданного);
	СтруктураВнешнейКоманды.Вставить("ИмяФормыОбъкта"			, 	ИмяФормыОбъкта);
	
	//Расположение группы дополнительных внешних команд, 
	//в случае, если не указано свойство "РасположениеГруппы", то группа внешних команд будет расположена в группе "КоманднаяПанель"
	СтруктураВнешнейКоманды.Вставить("РасположениеГруппы"		, 	Расположение);  //Тип "ГруппаФормы"
	
	//Указывается имя элемента (группы) преред которым будет расположена группа дополнительных команд, 
	//по умолчанию пред группами: ФормаЗакрыть - для справочников, ФормаОбновить - для документов и ЖурналГруппа1 - для журналов
	//в случае если указана "РасположениеГруппы" и не указано "ПередЭлементом", группа "ДополнительныеКоманды" будет размещена в конце группы "РасположениеГруппы"
	СтруктураВнешнейКоманды.Вставить("ПередЭлементом"			, 	ПередЭлементом);  //Тип "ГруппаФормы"
	
	//если указаны совойста "РасположениеГруппы" и "ПередЭлементом", заполнение свояства "ИмяТабличнойЧасти" необязатлеьно
	СтруктураВнешнейКоманды.Вставить("ИмяТабличнойЧасти"		, 	ИмяТабличнойЧасти);
	
	МассивПараметровВнешнейКоманды.Добавить(СтруктураВнешнейКоманды);
	
	СтруктураОписания.Вставить("ПараметрыВнешнейКоманды" ,	МассивПараметровВнешнейКоманды);

КонецПроцедуры

Процедура УстановитьКомандыВнешнегоОбъекта(СтруктураОписания, ИмяКоманды, ПредставлениеКоманды, ИмяКартинки=Неопределено,ОсновнаяКоманда=Ложь) Экспорт
	
	МассивОписанийКоманд = Новый Массив;
	Если СтруктураОписания.Свойство("КомандыОбъекта") Тогда
		МассивОписанийКоманд = СтруктураОписания.КомандыОбъекта;
	КонецЕсли;
	
	СтруктураКомандОбъекта = Новый Структура;
	СтруктураКомандОбъекта.Вставить("ИмяКоманды"			, ИмяКоманды);
	СтруктураКомандОбъекта.Вставить("ПредставлениеКоманды"	, ПредставлениеКоманды);
	СтруктураКомандОбъекта.Вставить("ИмяКартинки"			, ИмяКартинки);
	СтруктураКомандОбъекта.Вставить("ОсновнаяКоманда"		, ОсновнаяКоманда);
	
	МассивОписанийКоманд.Добавить(СтруктураКомандОбъекта);
	
	СтруктураОписания.Вставить("КомандыОбъекта", МассивОписанийКоманд);

КонецПроцедуры

// Процедура - Установить метаданные внешнего объекта
//
//	Остатавилвивет имя метаданных для которого доступна внешняя подписка
//
// Параметры:
//  СтруктураОписания	 - 	 структура, в которую будет добавлено опиание параметров внешней команды
//  ИмяМетаданных		 - 	 - 
//
Процедура  УстановитьМетаданныеВнешнейПодписки(СтруктураОписания, ИмяМетаданного) Экспорт 
	
	Массив = Новый Массив;
	Если СтруктураОписания.Свойство("МетаданныеПодписки") Тогда
		Массив = СтруктураОписания.МетаданныеПодписки;
	КонецЕсли;
	
	Массив.Добавить(ИмяМетаданного);
	
	СтруктураОписания.Вставить("МетаданныеПодписки", Массив);
	
КонецПроцедуры

// Процедура - Установить метаданные внешнего объекта
//
// Параметры:
//  СтруктураОписания	 - 	 - 
//  ИмяМетаданного		 - 	 - 
//
Процедура  УстановитьМетаданныеВнешнегоОбъекта(СтруктураОписания, ИмяМетаданного) Экспорт 
	
	Массив = Новый Массив;
	Если СтруктураОписания.Свойство("ИмяМетаданного") Тогда
		Массив = СтруктураОписания.ИмяМетаданного;
	КонецЕсли;
	
	Массив.Добавить(ИмяМетаданного);
	
	СтруктураОписания.Вставить("ИмяМетаданного", Массив);
	
КонецПроцедуры

// Процедура - Установить назначения внешнего объекта
//
// Параметры:
//  СтруктураОписания	 - 	 - 
//  ИмяМетаданного		 - 	 - 
//
Процедура  УстановитьНазначениеВнешнегоОбъекта(СтруктураОписания, ИмяМетаданного) Экспорт 
	
	Массив = Новый Массив;
	Если СтруктураОписания.Свойство("НазначениеОбъекта") Тогда
		Массив = СтруктураОписания.НазначениеОбъекта;
	КонецЕсли;
	
	Массив.Добавить(ИмяМетаданного);
	
	СтруктураОписания.Вставить("НазначениеОбъекта", Массив);
	
КонецПроцедуры

Процедура ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации) Экспорт
	
	ВнешняяОбработка 		=  ПарамерыРегистрации.ПодключаемыйОбъект;
	ПредставлениеОбработки 	= ?(ПустаяСтрока(ПарамерыРегистрации.Представление), СокрЛП(ВнешняяОбработка), ПарамерыРегистрации.Представление);
	
	Попытка
		
		Набор = РегистрыСведений.CW_ВнешниеПечатныеФормы.СоздатьНаборЗаписей();
		Набор.Отбор.Обработка.Установить(ВнешняяОбработка);
		Набор.Записать(Истина);
		
		Если ВнешняяОбработка.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли; 
		
		Для Каждого Метаданное Из ПарамерыРегистрации.ИменаМетаданных Цикл
			
			Запись = Набор.Добавить();
			Запись.Обработка 	= ВнешняяОбработка;
			Запись.Метаданное 	= CW_Обмены_ПИ.МетаданноеКонфигурации(Метаданное);
			
			Запись.Наименование = ПредставлениеОбработки;
			Запись.Индекс 		= ВнешняяОбработка.Индекс;
			
		КонецЦикла; 
		
		Набор.Записать(Истина);
		
	Исключение  
		
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки; 
	
КонецПроцедуры

Функция НоваяСтруктураПараметрыРегистрации() Экспорт

	ПарамерыРегистрации = Новый Структура;
	ПарамерыРегистрации.Вставить("ПодключаемыйОбъект", 	Неопределено);
	ПарамерыРегистрации.Вставить("Представление", 		"");
	ПарамерыРегистрации.Вставить("ИменаМетаданных", 	Новый Массив);
	
	Возврат ПарамерыРегистрации;
	
КонецФункции

Функция НоваяСтруктураРезультатаПечати() Экспорт
	
	ПараметрыВывода = Новый Структура("Количество,Печать", 1, Истина);
	
	РезультатПечати = Новый Структура;
	РезультатПечати.Вставить("Представление", 				"");
	РезультатПечати.Вставить("Параметры", 					ПараметрыВывода);
	РезультатПечати.Вставить("ПечатнаяФорма", 				Новый ТабличныйДокумент);
	РезультатПечати.Вставить("АдресЭлПочты", 				"");
	РезультатПечати.Вставить("АдресЭлПочтыКопия", 			"");
	РезультатПечати.Вставить("АдресЭлПочтыСкрытаяКопия", 	"");
	
	Возврат РезультатПечати;
	
КонецФункции


//Описание подключаемых обработок

// Функция - Получить представление по шаблону
//
// Параметры:
//  ПодключаемыйОбъект				 - 	 Модуль внешнего объекта 
//  ПараметрыПодключаемогоОбъекта	 - 	 Структура параметров подключаемого объекта
//			Свойства:
//				- ПодключаемыйОбъект 	- ссылка "Справочник.CW_подключаемыеОбъекты";
//				- ШаблонПредставления 	- шаблон представления печатной формы;
//				- Представление 		- Представление печатной формы, которое будет установлено, если не заполнен шаблон
//  ПараметрыПроцедуры				 - 	 структура с произволным составом свойств, передается в функцию метода макроса в качестве параметра
// 
// Возвращаемое значение:
//   - Строка -  Заполненный шаблон представления печатной формы
//
Функция ПолучитьПредставлениеПоШаблону(ПодключаемыйОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры = Неопределено) Экспорт

	Если ТипЗнч(ПараметрыПодключаемогоОбъекта) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	ШаблонПредставления = СокрЛП(ПараметрыПодключаемогоОбъекта.ШаблонПредставления);
	Если Не ЗначениеЗаполнено(ШаблонПредставления) Тогда
		Возврат ПараметрыПодключаемогоОбъекта.Представление;	
	КонецЕсли;
	
	Для Каждого СтрокаМакросов из ПараметрыПодключаемогоОбъекта.ПодключаемыйОбъект.Макросы Цикл
		//ИмяМакроса 		= "["+СокрЛП(СтрокаМакросов.ИмяМакроса)+"]";
		ИмяМакроса 		= СокрЛП(СтрокаМакросов.ИмяМакроса);
		ИмяМетода  		= СокрЛП(СтрокаМакросов.МетодМакроса);
		ЗначениеМакроса = Вычислить("ПодключаемыйОбъект."+ИмяМетода);
		
		ШаблонПредставления = СтрЗаменить(ШаблонПредставления, ИмяМакроса, ЗначениеМакроса);
	КонецЦикла;

	Возврат ШаблонПредставления;
	
КонецФункции

Функция ПолучитьМассивПредопределенныхМакросов()
	
	Массив = Новый Массив;
	Массив.Добавить("[НомерДокумента]");
	Массив.Добавить("[ДатаДокумента, dd.MM.yyyy]");
	Массив.Добавить("[ДатаДокумента, dd.MM.yy]");

	Возврат Массив;
	
КонецФункции
